mtx1228/lyx_code/FreeRTOS学习历程-FreeRTOS Kernel V10.4.4/16-互斥量解决优先级反转/FreeRTOS/Demo/CORTEX_STM32F103_Keil/main.c
/*
 * FreeRTOS V202104.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

/*
 * Creates all the demo application tasks, then starts the scheduler.  The WEB
 * documentation provides more details of the standard demo application tasks.
 * In addition to the standard demo tasks, the following tasks and tests are
 * defined and/or created within this file:
 *
 * "Fast Interrupt Test" - A high frequency periodic interrupt is generated
 * using a free running timer to demonstrate the use of the
 * configKERNEL_INTERRUPT_PRIORITY configuration constant.  The interrupt
 * service routine measures the number of processor clocks that occur between
 * each interrupt - and in so doing measures the jitter in the interrupt timing.
 * The maximum measured jitter time is latched in the ulMaxJitter variable, and
 * displayed on the LCD by the 'Check' task as described below.  The
 * fast interrupt is configured and handled in the timertest.c source file.
 *
 * "LCD" task - the LCD task is a 'gatekeeper' task.  It is the only task that
 * is permitted to access the display directly.  Other tasks wishing to write a
 * message to the LCD send the message on a queue to the LCD task instead of
 * accessing the LCD themselves.  The LCD task just blocks on the queue waiting
 * for messages - waking and displaying the messages as they arrive.
 *
 * "Check" task -  This only executes every five seconds but has the highest
 * priority so is guaranteed to get processor time.  Its main function is to
 * check that all the standard demo tasks are still operational.  Should any
 * unexpected behaviour within a demo task be discovered the 'check' task will
 * write an error to the LCD (via the LCD task).  If all the demo tasks are
 * executing with their expected behaviour then the check task writes PASS
 * along with the max jitter time to the LCD (again via the LCD task), as
 * described above.
 *
 */

/* Standard includes. */
#include <stdio.h>

/* Scheduler includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

/* Library includes. */
#include "stm32f10x_it.h"

extern void UART_Init(unsigned long ulWantedBaud);

/* Demo app includes. */
static void prvSetupHardware(void);

/*-----------------------------------------------------------*/

static volatile uint8_t flagLPTaskRun = 0;
static volatile uint8_t flagMPTaskRun = 0;
static volatile uint8_t flagHPTaskRun = 0;

static void vLPTask(void *pvParameters);
static void vMPTask(void *pvParameters);
static void vHPTask(void *pvParameters);

/*-----------------------------------------------------------*/

/* 互斥量/二进制信号量句柄 */
SemaphoreHandle_t xLock;

int main(void)
{
	prvSetupHardware();

	/* 创建互斥量/二进制信号量 */

	// /*此时是二进制信号量  可能会造成优先级反转的问题*/
	// xLock = xSemaphoreCreateBinary();
	// /*二进制信号量的初始值为0  需要give一下*/
	// xSemaphoreGive(xLock); /*give  信号量计数值 +1*/

	/*此时是互斥信号量  可以使用优先级继承实现优先级反转的问题*/
	/****
	 * 优先级较低的Task 获得锁，高优先级Task无法再次获得锁 从而进入阻塞状态
	 * 但是互斥量，高优先级Task将优先级给低优先级Task   让其解锁
	 * 低优先级Task继承了高优先级的优先级  优先运行  从而解锁
	 * */
	xLock = xSemaphoreCreateMutex(); /*互斥量初始值为1 不需要give*/

	if (xLock != NULL)
	{
		/* 创建3个任务: LP,MP,HP(低/中/高优先级任务)
		 */
		xTaskCreate(vLPTask, "LPTask", 1000, NULL, 1, NULL);
		xTaskCreate(vMPTask, "MPTask", 1000, NULL, 2, NULL);
		xTaskCreate(vHPTask, "HPTask", 1000, NULL, 3, NULL);

		/* 启动调度器 */
		vTaskStartScheduler();
	}
	else
	{
		/* 无法创建互斥量/二进制信号量 */
	}

	/* 如果程序运行到了这里就表示出错了, 一般是内存不足 */
	return 0;
}

/*-----------------------------------------------------------*/

/*-----------------------------------------------------------*/
static void vLPTask(void *pvParameters)
{
	const TickType_t xTicksToWait = pdMS_TO_TICKS(10UL);
	uint32_t i;
	char c = 'A';

	printf("LPTask start\r\n");

	/* 无限循环 */
	for (;;)
	{
		flagLPTaskRun = 1;
		flagMPTaskRun = 0;
		flagHPTaskRun = 0;

		/* 获得互斥量/二进制信号量 */
		xSemaphoreTake(xLock, portMAX_DELAY); /* 互斥量 计数值-1 */

		/* 耗时很久 */

		printf("LPTask take the Lock for long time");
		for (i = 0; i < 500; i++)
		{
			flagLPTaskRun = 1;
			flagMPTaskRun = 0;
			flagHPTaskRun = 0;
			printf("%c", c + i);
		}
		printf("\r\n");

		/* 释放互斥量/二进制信号量 */
		xSemaphoreGive(xLock); /* 互斥量 计数值 +1*/

		vTaskDelay(xTicksToWait);
	}
}

static void vMPTask(void *pvParameters)
{
	const TickType_t xTicksToWait = pdMS_TO_TICKS(30UL);

	flagLPTaskRun = 0;
	flagMPTaskRun = 1;
	flagHPTaskRun = 0;

	printf("MPTask start\r\n");

	/* 让LPTask、HPTask先运行 */
	vTaskDelay(xTicksToWait); /*延时30ms 此时轮到LPTask运行*/

	/* 无限循环 */
	/* 此时MPTask 一直占用CPU资源  C的优先级比B高，C也无法抢占*/
	for (;;)
	{
		flagLPTaskRun = 0;
		flagMPTaskRun = 1;
		flagHPTaskRun = 0;
	}
}

static void vHPTask(void *pvParameters)
{
	const TickType_t xTicksToWait = pdMS_TO_TICKS(10UL);

	flagLPTaskRun = 0;
	flagMPTaskRun = 0;
	flagHPTaskRun = 1;

	printf("HPTask start\r\n");

	/* 让MPTask先运行 */
	vTaskDelay(xTicksToWait); /*此时延时10ms  轮到MPtask运行*/

	/* 无限循环 */
	for (;;)
	{
		flagLPTaskRun = 0;
		flagMPTaskRun = 0;
		flagHPTaskRun = 1;
		printf("HPTask wait for Lock\r\n");

		/* 获得互斥量/二进制信号量 */
		xSemaphoreTake(xLock, portMAX_DELAY); /*此时 互斥量计数值 -1 获得LPTask的锁*/

		flagLPTaskRun = 0;
		flagMPTaskRun = 0;
		flagHPTaskRun = 1;

		/* 释放互斥量/二进制信号量 */
		xSemaphoreGive(xLock); /*此时 互斥量计数值 +1 此时轮到其他两个Task竞争资源 MPTask优先级较高 轮到它执行*/
	}
}

/*-----------------------------------------------------------*/

/*-----------------------------------------------------------*/

static void prvSetupHardware(void)
{
	/* Start with the clocks in their expected state. */
	RCC_DeInit();

	/* Enable HSE (high speed external clock). */
	RCC_HSEConfig(RCC_HSE_ON);

	/* Wait till HSE is ready. */
	while (RCC_GetFlagStatus(RCC_FLAG_HSERDY) == RESET)
	{
	}

	/* 2 wait states required on the flash. */
	*((unsigned long *)0x40022000) = 0x02;

	/* HCLK = SYSCLK */
	RCC_HCLKConfig(RCC_SYSCLK_Div1);

	/* PCLK2 = HCLK */
	RCC_PCLK2Config(RCC_HCLK_Div1);

	/* PCLK1 = HCLK/2 */
	RCC_PCLK1Config(RCC_HCLK_Div2);

	/* PLLCLK = 8MHz * 9 = 72 MHz. */
	RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_9);

	/* Enable PLL. */
	RCC_PLLCmd(ENABLE);

	/* Wait till PLL is ready. */
	while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET)
	{
	}

	/* Select PLL as system clock source. */
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);

	/* Wait till PLL is used as system clock source. */
	while (RCC_GetSYSCLKSource() != 0x08)
	{
	}

	/* Enable GPIOA, GPIOB, GPIOC, GPIOD, GPIOE and AFIO clocks */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | RCC_APB2Periph_AFIO, ENABLE);

	/* SPI2 Periph clock enable */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);

	/* Set the Vector Table base address at 0x08000000 */
	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);

	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

	/* Configure HCLK clock as SysTick clock source. */
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);

	// vParTestInitialise();

	UART_Init(115200);
}
/*-----------------------------------------------------------*/

#ifdef DEBUG
/* Keep the linker happy. */
void assert_failed(unsigned char *pcFile, unsigned long ulLine)
{
	for (;;)
	{
	}
}
#endif
